Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་ནི་འཁྲུག་པ་མེད་པ་སྟེ་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའོ།
en: There is no agitation in enlightenment, as it is utterly pure by nature.

source: །རིགས་ཀྱི་བུ་སྐྱེ་བ་དང་འཇིག་པ་ནི་གཉིས་ཏེ། གང་མ་སྐྱེས་མ་བྱུང་བ་དེ་ལ་འཇིག་པ་གང་ཡང་མེད་དེ།
en: “Noble sir, production and destruction are two, but what is not produced and does not occur cannot be destroyed.

source: །བྱང་ཆུབ་ནི་རབ་ཏུ་སྣང་བ་སྟེ་ངོ་བོ་ཉིད་རྣམ་པར་དག་པའོ།
en: Enlightenment is radiance, pure in essence.

source: །བྱང་ཆུབ་ནི་འཛིན་པ་མེད་པ་སྟེ་ཤིན་ཏུ་དམིགས་པ་མེད་པའོ།
en: Enlightenment is without subjectivity and completely without object.

source: །བྱང་ཆུབ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས་ཐ་དད་པ་མེད་པའོ།
en: Enlightenment, which penetrates the equality of all things, is undifferentiated.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་དུ་ལེགས་པར་གསུངས་པ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །བཅོམ་ལྡན་འདས་ལེགས་སོ།
en: “Lord, the beautiful teachings of the Tathāgata are wonderful and truly excellent.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ད་སླན་ཆད་ནོངས་པ་འདི་དག་སྤང་བར་བགྱིའོ།
en: Lord, from this time forth, I will avoid all such errors and

source: །དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མ་མཆིས་པ་ནས་ཡང་དག་པར་བསྒྲུབས་པ་འདི་བསྲུང་བར་བགྱིའོ། །གཟུང་བར་བགྱིའོ།
en: will defend and uphold this attainment of unexcelled, perfect enlightenment by the Tathāgata during innumerable hundreds of thousands of millions of billions of eons!

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བ་དེར་འདུས་པ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The bodhisattva Dharmavikurvaṇa declared,

source: །བསྐལ་པ་དག་ནི་བྱེ་བ་དང་། །བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱར་ནི། །བཅོམ་ལྡན་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་།
en: “Even for the buddhas themselves, During a million eons, Or even a hundred million eons,

source: །དེ་ཡི་ཡོན་ཏན་མཐའ་བརྗོད་དཀའ།
en: It would be hard to express all their virtues.

source: །ཡེ་ཤེས་མཐའ་ཡས་རྫོགས་པས་ན། །སྲོག་ཆགས་མཐའ་ཡས་གྲོལ་བར་བྱེད།
en: Having perfected an infinite wisdom, They liberate an infinity of living beings.

source: །བྱང་ཆུབ་ནི་དཔེ་བསྟན་པ་དང་བྲལ་བས་དཔེ་མེད་པའོ།
en: Enlightenment, which is not shown by any example, is incomparable.

source: །དེ་དག་སློབ་པ་མཐའ་ཡས་ཤིང་། །སྤྱོད་ཡུལ་རྣམས་ཀྱང་མཐའ་ཡས་ཏེ།
en: “Their practices are infinite; And their spheres of influence are infinite;

source: །བྱང་ཆུབ་ནི་ཤིན་ཏུ་ཁོང་དུ་ཆུད་པར་དཀའ་བའི་ཕྱིར་ཕྲ་བའོ།
en: Enlightenment is subtle, since it is extremely difficult to realize.

source: །བྱང་ཆུབ་ནི་ནམ་མཁའི་རང་བཞིན་པས་ན་ཐམས་ཅད་དུ་སོང་བ་སྟེ།
en: Enlightenment is all-pervasive, as it has the nature of infinite space.

source: དེ་ནི་ལུས་ཀྱིས་སམ། སེམས་ཀྱིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Enlightenment cannot be realized, either physically or mentally.

source: །སེམས་ནི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། རྟེན་མེད་པ། རྣམ་པར་རིག་པ་མེད་པའོ།
en: And the mind is immaterial, invisible, baseless, and unconscious.’

source: །བཅོམ་ལྡན་འདས་བསྟན་པ་འདི་བཤད་པ་ན་འཁོར་དེ་ནས་ལྷའི་བུ་ཉིས་བརྒྱ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: “Lord, when Vimalakīrti had discoursed thus, two hundred of the deities in that assembly attained the tolerance of the birthlessness of things.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the four Mahārājas, the great kings of the quarters, said to the Buddha,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལིད་ཙ་བཱི་གཞོན་ནུ་འོད་བཀོད་པ་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the young Licchavi Prabhāvyūha

source: འོད་བཀོད་པ་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Prabhāvyūha, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: གྲངས་དང་བྲལ་བ།
en: He surpasses all calculations.

source: མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པ།
en: He is utterly unequaled,

source: །འོད་བཀོད་པས་ཀྱང་གསོལ་པ།
en: Prabhāvyūha replied,

source: གཞལ་བ་ལས་ཤིན་ཏུ་འདས་པ།
en: He surpasses all measure.

source: བདག་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་བ་དང་།
en: when I was going out of the great city of Vaiśālī,

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ནང་དུ་མཆི་བ་དང་མཇལ་ཏེ།
en: I met the Licchavi Vimalakīrti coming in.

source: དེས་བདག་ལ་གུས་པར་སྨྲས་པ་དང་། བདག་གིས་འདི་སྐད་ཅེས་བགྱིས་སོ།
en: He greeted me, and I then addressed him:

source: །ཁྱིམ་བདག་ཁྱོད་ག་ལས་འོངས་དེས་བདག་ལ་སྨྲས་པ།
en: ‘Householder, where do you come from?’ He replied,

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ནས་འོངས་སོ།
en: ‘I come from the seat of enlightenment.’

source: །བདག་གིས་དེ་ལ་སྨྲས་པ།
en: I then inquired,

source: །མ་རིག་པའི་ཟག་པ་ཟད་པ་ནས་རྒ་ཤིའི་བར་གྱི་ཟག་པ་ཟད་པའི་ཕྱིར་དེ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་སྙིང་པོའོ།
en: “ ‘It is the seat of interdependent origination, because it proceeds from the exhaustion of ignorance to the exhaustion of old age and death.

source: །འཇིག་རྟེན་ཐམས་ཅད་མི་སླུ་བའི་ཕྱིར་དེ་ནི་བདེན་པའི་སྙིང་པོའོ།
en: It is the seat of truth, because it does not deceive anyone.

source: །འདུས་བྱས་དང་འདུས་མ་བྱས་སྤོང་བའི་ཕྱིར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of the aids to enlightenment, because it eliminates the duality of the compounded and the uncompounded.

source: །ཚུལ་བཞིན་སོ་སོར་རྟོག་པའི་ཕྱིར་དེ་ནི་ངེས་པར་སེམས་པའི་སྙིང་པོའོ།
en: It is the seat of decisiveness, because of its precise discrimination.

source: །ནན་ཏན་སྙིང་པོར་བྱེད་པའི་ཕྱིར་དེ་ནི་ཐོས་པའི་སྙིང་པོའོ།
en: It is the seat of learning, because it makes practice of the essence.

source: །སེམས་ཅན་ཐམས་ཅད་སྡུད་པའི་ཕྱིར་དེ་ནི་བསྡུ་བའི་དངོས་པོའི་སྙིང་པོའོ།
en: It is the seat of the means of unification, because it brings together living beings.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་དེ་ནི་ཐབས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of liberative art, because it develops living beings.

source: །མི་རྟོག་པའི་ཕྱིར་དེ་ནི་རྣམ་པར་ཐར་པའི་སྙིང་པོའོ།
en: It is the seat of liberation, because it does not intellectualize.

source: །དྲུག་མངོན་པར་ཤེས་པས་དེ་ནི་མངོན་པར་ཤེས་པའི་སྙིང་པོའོ།
en: “ ‘It is the seat of paranormal perception, because it has the six superknowledges.

source: བཙུན་པ་ཤཱ་རིའི་བུ་གང་སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པའི་བུད་མེད་དམ་སྐྱེས་པ་ལ་ཁྱོད་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་ཞེས་དྲིས་ན་དེའི་ལན་ཅི་སྐད་ཅེས་འདེབས།
en: Reverend Śāriputra, if one were to ask a man or woman created by a magician where he or she had died to reincarnate there, what do you think he or she would answer?

source: །རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤངས་པའི་ཕྱིར་དེ་ནི་བཏང་སྙོམས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of equanimity, because it abandons affection and aversion.

source: །ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པའི་ཕྱིར་དེ་ནི་དགའ་བའི་སྙིང་པོའོ།
en: It is the seat of joy, because it is joyfully devoted to the bliss of the Dharma.

source: །གནོད་པ་ཐམས་ཅད་བཟོད་པའི་ཕྱིར་དེ་ནི་སྙིང་རྗེའི་སྙིང་པོའོ།
en: It is the seat of compassion, because it tolerates all injuries.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའི་ཕྱིར་དེ་ནི་བྱམས་པའི་སྙིང་པོའོ།
en: “ ‘It is the seat of love, because it is equal to all living beings.

source: །མངོན་སུམ་དུ་མཐོང་བའི་ཕྱིར་དེ་ནི་ཤེས་རབ་ཀྱི་སྙིང་པོའོ།
en: It is the seat of wisdom, because it sees everything directly.

source: །སེམས་ལས་སུ་རུང་བའི་ཕྱིར་དེ་ནི་བསམ་གཏན་གྱི་སྙིང་པོའོ།
en: It is the seat of meditation, because it generates fitness of mind.

source: བཙུན་པ་ཤཱ་རིའི་བུ་འཆི་འཕོ་ཞེས་བྱ་བ་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་དོ། །སྐྱེ་བ་ཞེས་བྱ་བ་དེ་ནི་ང་མངོན་པར་འདུ་བྱེད་པའི་རྒྱུན་ཏོ།
en: Reverend Śāriputra, “death” is an end of performance, and “rebirth” is the continuation of performance.

source: །ཕྱིར་མི་ལྡོག་པའི་ཕྱིར་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of effort, because it does not turn back.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཆི་འཕོ་ཡང་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་ཟད་པར་མི་བྱེད་དོ།
en: But, although a bodhisattva dies, he does not put an end to the performance of the roots of virtue,

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བའི་སེམས་མེད་པས་དེ་ནི་བཟོད་པའི་སྙིང་པོའོ།
en: It is the seat of tolerance, because it is free of anger toward any living being.

source: ། དེ་སྐྱེ་ཡང་མི་དགེ་བའི་རྒྱུན་འབྲེལ་བར་མི་བྱེད་དོ།
en: and although he is reborn, he does not adhere to the continuation of sin.

source: །སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of morality, because it fulfills all commitments.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then, the Buddha said to the venerable Śāriputra,

source: །རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའི་ཕྱིར་དེ་ནི་སྦྱིན་པའི་སྙིང་པོའོ།
en: “ ‘It is the seat of generosity, because it has no expectation of reward.

source: ། ཡང་དག་པར་མི་བརྗེད་པའི་ཕྱིར་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of the great spirit of enlightenment, because it does not neglect anything.

source: །ཁྱད་པར་དུཁོང་དུ་ཆུད་པའི་ཕྱིར་དེ་ནི་ལྷག་པའི་བསམ་པའི་སྙིང་པོའོ།
en: It is the seat of high resolve, because its insight is superior.

source: །རྩོམ་པའི་ལས་སྒྲོལ་བའི་ཕྱིར་དེ་ནི་སྦྱོར་བའི་སྙིང་པོའོ།
en: It is the seat of effort, because it releases energetic activities.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་ཕྱིར་བསམ་པའི་སྙིང་པོའོ།
en: ‘Noble son, the seat of enlightenment is the seat of positive thought because it is without artificiality.

source: དེས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: He then spoke the following words to me:

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་གང་གི་ཚིག་བླ་དགས།
en: ‘What is meant by “seat of enlightenment”?’

source: །ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་ཕྱིར་དེ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བའི་སྙིང་པོའོ།
en: It is the seat of eradication of all afflictions, because it is perfectly enlightened about the nature of reality.

source: ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་ཤིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་མུན་པ་ཡང་རྣམ་པར་སེལ་ཏོ།
en: Since they do not associate with the afflictions, they dispel the darkness of the afflictions of all living beings.

source: རིགས་ཀྱི་བུ་དེ་གཉིས་མི་འགྲོགས་ཏེ།
en: Noble sir, those two do not go together.

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་བྱང་ཆུབ་ཀྱི་ཤིང་དང་།
en: the tree of enlightenment of the Tathāgata Akṣobhya;

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ཡང་འཁོར་རྒྱ་མཚོ་སྙེད་ཀྱི་ནང་ན་བཞུགས་ཤིང་ཆོས་འཆད་པ་དང་།
en: and the Tathāgata Akṣobhya himself, seated in the middle of an assembly vast as an ocean, teaching the Dharma.

source: །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུ་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་ནས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་དྲུང་ནས་འདིར་འོངས་སོ།
en: “Śāriputra, this holy person came here from the presence of the Tathāgata Akṣobhya in the universe Abhirati.”

source: ཚངས་པའི་གནས་དང་འཁོར་དུ་བཅས་པ་དང་།
en: its Brahmā and his retinues;

source: ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Śāriputra, what do you think?

source: ཉི་མའི་དཀྱིལ་འཁོར་ཤར་མ་ཐག་ཏུ་མུན་པ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ།
en: As soon as the sun rises, all darkness is destroyed.

source: །སེམས་ཅན་ཐམས་ཅད་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྙིང་པོའོ།
en: It is the seat of all living beings, because all living beings are without intrinsic identity.

source: །སྟོང་པ་ཉིད་མངོན་པར་བྱང་ཆུབ་པའི་ཕྱིར། དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྙིང་པོའོ།
en: It is the seat of all things, because it is perfectly enlightened with regard to voidness.

source: །མི་གཡོ་བའི་ཕྱིར་དེ་ནི་བདུད་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་སྙིང་པོའོ།
en: “ ‘It is the seat of the conquest of all devils, because it never flinches.

source: །འཇུག་པ་དང་བྲལ་བའི་ཕྱིར་དེ་ནི་ཁམས་གསུམ་པའི་སྙིང་པོའོ།
en: It is the seat of the triple world, because it is free of involvement.

source: །མི་འཇིགས་ཤིང་མི་དངངས་པའི་ཕྱིར་དེ་ནི་སེང་གེའི་སྒྲ་སྒྲོགས་པའི་བརྩོན་འགྲུས་ཀྱི་སྙིང་པོའོ།
en: It is the seat of the heroism that sounds the lion’s roar, because it is free of fear and trembling.

source: རི་རབ་དང་། རི་བོ་དང་། དེའུ་དང་། བོག་རིར་བཅས་པ་དང་།
en: its Mount Sumeru and other hills and mountain ranges;

source: འབབ་ཆུ་དང་། མཚེའུ་དང་། ཆུ་མིག་དང་། མཚོ་དང་། རྒྱ་མཚོའི་འོབས་དང་བཅས་པ་དང་།
en: its rivers, lakes, fountains, streams, oceans, and other bodies of water;

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་གནས་པ་ཁོ་ར་ཁོར་ཡུག་གི་རིས་བསྐོར་བ་དང་བཅས་པ་དང་།
en: its abodes of devas, nāgas, yakṣas, gandharvas, and asuras, bounded by its Cakravāḍa mountains;

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་དུ་མ་དང་།
en: its hundreds of thousands of bodhisattvas;

source: །འགྲོ་བ་འཛིན་གྱིས་ཀྱང་གསོལ་པ།
en: Jagatindhara replied,

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་འཛིན་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the bodhisattva Jagatindhara,

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: Then the Licchavi Vimalakīrti thought,

source: འགྲོ་བ་འཛིན་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Jagatindhara, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: །རིགས་ཀྱི་བུ་འཁོར་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེ་མཐོང་བར་འདོད་ཀྱིས་འཁོར་འདི་ལ་ཁྱོད་ཀྱིས་སྟོན་ཅིག
en: “Noble son, this multitude wishes to behold the universe Abhirati and the Tathāgata Akṣobhya—show them!”

source: བདག་ཀྱང་དེ་ནས་སྤོབས་པ་མ་མཆིས་པར་གྱུར་ཏོ།
en: and I became speechless.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Buddha, knowing the thoughts of the entire multitude, said to the Licchavi Vimalakīrti,

source: བཅོམ་ལྡན་འདས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ནི་བསྙེན་པར་དཀའ་ཞིང་ཟབ་མོའི་ཚུལ་ལ་སྤོབས་པ་རབ་ཏུ་ཞུགས་པ།
en: “Lord, it is difficult to attend upon the Licchavi Vimalakīrti. He is gifted with marvelous eloquence concerning the law of the profound.

source: །བཅོམ་ལྡན་འདས་བསྟན་པ་འདི་བཤད་པ་ན།
en: “Lord, when Vimalakīrti had explained this teaching,

source: ལྷ་དང་མི་ལྔ་བརྒྱ་ཙམ་གྱིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: five hundred gods and men conceived the spirit of enlightenment,

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་འོངས་ཤིང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་གནས་སོ།
en: They come from the qualities of the Buddha, and stand on the qualities of the Buddha.’

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་དང་།
en: “ ‘Noble son, when bodhisattvas are thus endowed with the transcendences,

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་གྲུབ་པའི་ཕྱིར་དེ་ནི་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་ཆོས་ཐམས་ཅད་མ་ལུས་པར་ཁོང་དུ་ཆུད་པའི་སྙིང་པོའོ།
en: It is the seat of instantaneous, total understanding of all things, because it realizes fully the gnosis of omniscience.

source: །ཉོན་མོངས་པ་མ་ལུས་པའི་ཕྱིར་དེ་ནི་རིག་པ་གསུམ་གྱི་སྙིང་པོའོ།
en: It is the seat of the three knowledges, because in it no passions remain.

source: །ཐམས་ཅད་དུ་མ་སྨད་པའི་ཕྱིར་དེ་ནི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྙིང་པོའོ།
en: It is the seat of the strengths, the fearlessnesses, and all the special qualities of the Buddha, because it is irreproachable in all respects.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན་རང་གི་གནས་ན་མཆིས་པའི་ཚེ་
en: Why? Lord, I remember that one day, when I was at home,

source: །བཅོམ་ལྡན་འདས་དེའི་དུས་ན་འདི་ལྟ་བུའི་མདོ་སྡེ་འདི་ལ་མོས་པ་དང་། རབ་ཏུ་འཇུག་པར་འགྱུར་བ་དེ་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བྱིན་གྱི་རླབས་ལགས་པར་རིག་པར་བགྱིའོ།
en: Lord, and thus it may be known that in that future time those who believe in this teaching and who enter deeply into it will be sustained by the supernatural blessing of the bodhisattva Maitreya.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་ལེགས་སོ་ལེགས་སོ།
en: Thereupon the Buddha gave his approval to the bodhisattva Maitreya: “Excellent! Excellent!

source: །རིགས་ཀྱི་བུ་དེ་དག་ཀྱང་མོས་པར་བགྱིའོ།
en: May all noble sons and daughters believe in that!”

source: དེ་བཞིན་གཤེགས་པའང་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲས་པ་དེ་ལ་རྗེས་སུ་ཡི་རང་བ་གནང་བ་མཛད་དོ།
en: The Tathāgata rejoices and commends your good promise.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་དབྱངས་གཅིག་ཏུ་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then all the bodhisattvas said together in one voice,

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: “Lord, we also, after the ultimate liberation of the Tathāgata,

source: སངས་རྒྱས་ཀྱི་ཞིང་སོ་སོ་ནས་མཆིས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འདི་རྒྱས་པར་བགྱིའོ།
en: will come from our various buddhafields to spread far and wide this enlightenment of the perfect Buddha, the Tathāgata.

source: བདག་གི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་དེ་འཁོར་དང་བཅས་པ་བདག་ལ་མདུན་གྱིས་བལྟས་ཏེ་ཕྱོགས་གཅིག་ཏུ་མཆིས་སོ།
en: Having saluted me by touching my feet with his head, he withdrew with his retinue to one side.

source: ། བདག་ནི་དེ་ལ་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ལགས་སྙམ་བགྱིད་དེ། བདག་གིས་དེ་ལ་འདི་སྐད་ཅེས་བགྱིས་སོ།
en: I then, thinking he was Śakra, the king of the gods, said to him,

source: །ཀཽ་ཤི་ཀ་ཁྱོད་ལེགས་པར་འོངས་སོ།
en: ‘Welcome, O Kauśika!

source: ཚིག་དང་ཚིག་འབྲུ་སྣ་ཚོགས་ལ་དད་པའི་ཕྱག་རྒྱ་དང་།
en: The first gesture is to believe in all sorts of phrases and words,

source: ཆོས་ཀྱི་ཚུལ་ཟབ་མོས་མི་སྐྲག་ཅིང་། ཡང་དག་པ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པའི་ཕྱག་རྒྱ་སྟེ།
en: and the second gesture is to penetrate exactly the profound principle of the Dharma without being afraid.

source: །འདོད་པའི་དགའ་བ་ཐམས་ཅད་ལ་བག་ཡོད་པར་གྱིས་ཤིག
en: You should remain consciously aware in the midst of the pleasures of desire.

source: །ལུས་དང་། སྲོག་དང་། ལོངས་སྤྱོད་རྣམས་ལས་སྙིང་པོ་བླངས་པ་དང་། མི་རྟག་པར་རྟོག་པ་མང་དུ་གྱིས་ཤིག
en: You should often think on impermanence and strive to utilize the essential in body, life, and wealth.’

source: བྱམས་པ་དེ་གཉིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱག་རྒྱའོ།
en: Such are the two gestures of the bodhisattvas.

source: །དེ་ནས་བདུད་སྡིག་ཅན་འཇིགས་ཤིང་སྐྲག་ནས་མི་འཚལ་བཞིན་དུ་ལྷའི་བུ་མོ་དེ་རྣམས་ཕུལ་ལོ།
en: “Then Māra was even more frightened and, much against his will, gave the heavenly maidens.

source: གདོད་བདག་གི་གནས་སུ་འགྲོ་ནུས་པར་འགྱུར་རོ།
en: and only then will you be able to return to your own abode.’

source: སྡིག་ཅན་ཁྱོད་ཀྱིས་ལྷའི་བུ་མོ་འདི་རྣམས་སྐྱེས་བུ་དམ་པ་འདི་ལ་ཕུལ་ཅིག་དང་།
en: ‘Evil One, give these heavenly maidens to the good man Vimalakīrti,

source: །དེ་ནས་བར་སྣང་ལས་སྒྲ་བྱུང་སྟེ།
en: Then a voice resounded in the sky, saying,

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་འདིས་བདག་ལ་བསླུ་སུ་འོང་ངོ་ཞེས་
en: thinking that the Licchavi Vimalakīrti had come to expose him.

source: དེ་མི་སྣང་བར་བགྱི་བར་འཚལ་བ་མ་ནུས་ཏེ། རྫུ་འཕྲུལ་ཐམས་ཅད་བསྟན་ཀྱང་མི་སྣང་བར་མ་ནུས་སོ།
en: He tried to make himself invisible, but, try as he might with all his magical powers, he could not vanish from sight.

source: དེ་ནས་བདུད་སྡིག་ཅན་འཇིགས་ཤིང་སྐྲག་ནས་མི་དགའ་སྟེ།
en: “Then Māra was terrified and distressed,

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་བདུད་སྡིག་ཅན་དེ་ལ་འདི་སྐད་དུ་
en: “Then the Licchavi Vimalakīrti said to Māra,

source: བདུད་སྡིག་ཅན་ལྷའི་བུ་མོ་འདི་རྣམས་དགེ་སྦྱོང་ཤཱཀྱའི་སྲས་ལ་ནི་རུང་བ་མ་ཡིན་གྱིས་ང་ལ་བྱིན་ཅིག་ཅེས་བགྱིས་པ་དང་།
en: ‘Evil Māra, since these heavenly maidens are not suitable for this religious devotee, a son of the Śākya, give them to me.’

source: །འདི་ནི་བདུད་སྡིག་ཅན་ཏེ། ཁྱོད་ལ་ཅོ་དྲི་བའི་ཕྱིར་འོངས་ཀྱི་བརྒྱ་བྱིན་ནི་མ་ཡིན་ནོ་ཞེས་མཆིའོ།
en: This is not Indra but the evil Māra, who has come to ridicule you.’

source: །འདི་དག་ནི་ངེད་ལ་རུང་བ་མ་ཡིན་ནོ་ཞེས་བགྱིས་སོ།
en: It is not proper for me to have these maidens.’

source: །བཀའ་མཆིད་དེ་བགྱིས་པ་དང་། ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་དུ་
en: “No sooner had I said these words than the Licchavi Vimalakīrti came there and said to me,

source: རིགས་ཀྱི་བུ་འདི་ལ་བརྒྱ་བྱིན་ཡིན་སྙམ་དུ་འདུ་ཤེས་མ་སྐྱེད་ཅིག
en: ‘‌Noble son, do not think that this is Indra!

source: དེ་ལ་བདག་གིས་འདི་སྐད་དུ་ཀཽ་ཤི་ཀ་རུང་བ་མ་ཡིན་པའི་དངོས་པོ་དག་དགེ་སྦྱོང་ཤཱཀྱའི་སྲས་ལ་མ་འབུལ་ཅིག
en: “I replied, ‘O Kauśika, do not offer me, who am religious and a son of the Śākya, things which are not appropriate.

source: །སྐྱེས་བུ་དམ་པ་ལྷའི་བུ་མོ་ཁྲི་ཉིས་སྟོང་འདི་དག་བདག་ལས་ཁྱོད་ཀྱིས་ལོང་ལ་འདི་དག་ཁྱོད་ཀྱི་གཡོག་གྱིས་ཤིག་ཅེས་མཆི་བ་དང་།
en: ‘Good sir, accept from me these twelve thousand divine maidens and make them your servants.’

source: །དེ་ནས་དེས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: “Māra then said to me,

source: །བྱམས་པ་དེ་ལ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྒྱུ་གཉིས་ཀྱིས་བདག་ལ་རྨ་འབྱིན་ཏེ།
en: “Maitreya, there are two reasons that beginner bodhisattvas hurt themselves

source: ཆོས་ཟབ་མོ་ལ་ངེས་པར་སེམས་པར་མི་འགྱུར་རོ།
en: and do not concentrate on the profound Dharma.

source: །བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱག་རྒྱ་ནི་འདི་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན།
en: “Maitreya, there are two gestures of the bodhisattvas. What are they?

source: །རྒྱུ་དེ་གཉིས་ཀྱིས་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་ལ་རྨ་འབྱིན་ཏེ་ཆོས་ཟབ་མོ་ལ་ངེས་པར་མི་རྟོག་པའོ།
en: These are the two reasons the beginner bodhisattvas hurt themselves and do not penetrate the profound Dharma.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའང་མྱུར་དུ་ཐོབ་པར་མི་འགྱུར་རོ།
en: and will not quickly attain the tolerance of the ultimate birthlessness of all things.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Having been thus taught, the bodhisattva Maitreya said to the Buddha,

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པས་ནི་སེམས་ཅན་ལ་ཕན་འདོགས་ཤིང་ཆོས་ཀྱི་སྦྱིན་པས་མ་ཡིན་ཏེ།
en: They help living beings by means of material gifts and do not help them by means of the gift of the Dharma.

source: བྱམས་པ་ཟབ་མོ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱུ་འདི་གཉིས་ཀྱིས་བདག་ཉིད་ལ་རྨ་འབྱིན་ཏེ།
en: Such, Maitreya, are the two reasons the bodhisattvas who aspire to the profound Dharma hurt themselves

source: དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: and gandharvas, rejoiced exceedingly.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: All heartily praised these declarations by the Lord.

source: མི་འབྱུང་མི་འཇིག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Nonoccurrence and nondestruction are the entrance into nonduality.”

source: །།འཕགས་པ་དྲི་མ་མེད་པར་གྲགས་པས་བསྟན་པ་ཞེས་བྱ་བ། ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the Noble Mahāyāna Sūtra “The Teaching of Vimalakīrti.”

source: །མ་འོངས་པའི་རིགས་ཀྱི་བུ་ཕོ་དང་། རིགས་ཀྱི་བུ་མོ་སྣོད་དུ་གྱུར་པ་དེ་དག་ལ་མདོ་སྡེ་འདི་ལྟ་བུ་ལག་ཏུ་སོན་པར་བགྱིའོ།
en: In the future, I will place in the hands of noble sons and noble daughters who are worthy vessels of the holy Dharma this profound teaching.

source: །དེ་ནས་དྲི་མ་མེད་པར་གྲགས་པས་ལྷའི་བུ་མོ་དེ་རྣམས་བླངས་ནས་ལྷའི་བུ་མོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The Licchavi Vimalakīrti, having received the goddesses, said to them,

source: །ཁྱོད་བདུད་སྡིག་ཅན་གྱིས་ང་ལ་བྱིན་གྱིས་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག
en: ‘Now that you have been given to me by Māra, you should all conceive the spirit of unexcelled, perfect enlightenment.’

source: །དེས་དེ་དག་ལ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་རྗེས་སུ་འཐུན་པའི་གཏམ་བགྱིས་པ་དང་དེ་དག་ཀྱང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: “He then exhorted them with discourse suitable for their development toward enlightenment, and soon they conceived the spirit of enlightenment.

source: །འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཉིད་བཅིངས་པས་ཕ་རོལ་བཅིངས་པ་ལས་འགྲོལ་བ་དེ་ནི་གནས་མེད་དེ།
en: As the Lord declares: ‘It is not possible for one who is himself bound to deliver others from their bondage.

source: གང་ཚུལ་གཅིག་པ་འདི་ལ་འཇུག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Thus, the entrance into this principle of uniqueness is the entrance into nonduality.”

source: །གྲོལ་བཞིན་དུ་སྐྱེ་ཞིང་གྲོལ་བཞིན་དུ་འབྱུང་བས་སེམས་ཅན་བཅིངས་པ་རྣམས་བཅིངས་པ་ལས་གྲོལ་བའི་ཆོས་སྟོན་པར་ནུས་ཤིང་མཐུ་ཡོད་དོ།
en: Being reincarnated as if being liberated, he has the power and ability to teach the Dharma that liberates living beings from their bondage.

source: །དེ་ནས་ཡང་དེས་དེ་དག་ལ་ཁྱེད་ཀྱིས་ང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཟིན་གྱིས་
en: He then said to them, ‘You have just conceived the spirit of enlightenment.

source: ད་ཕན་ཆད་ཁྱེད་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པར་གྱིས་ལ་འདོད་པ་ལ་དགའ་ཞིང་མོས་པར་མ་བྱེད་ཅིག་ཅེས་བསྒོའོ།
en: From now on, you should devote yourselves to finding joy in the pleasures of the Dharma, and should take no pleasure in desires.’

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Licchavi Vimalakīrti, aware of what the venerable Śāriputra was thinking, spoke to him:
